export const teachersList = [
    {
        id: "kamelin",
        name: "Камелин Рудольф Владимирович",
        years: "(1938 - 2016)",
        regalia: "профессор, доктор биологических наук, член-корреспондент РАН, заведующий отделом «Гербарий высших растений» Ботанического института РАН, президент Русского ботанического общества.",
        link: "https://ru.wikipedia.org/wiki/%D0%9A%D0%B0%D0%BC%D0%B5%D0%BB%D0%B8%D0%BD,_%D0%A0%D1%83%D0%B4%D0%BE%D0%BB%D1%8C%D1%84_%D0%92%D0%BB%D0%B0%D0%B4%D0%B8%D0%BC%D0%B8%D1%80%D0%BE%D0%B2%D0%B8%D1%87",
        isPassedAway: true
    },
    {
        id: "krasnoborov",
        name: "Красноборов Иван Моисеевич",
        years: "(1931—2011)",
        regalia: "зав. лабораторией, профессор, доктор биологических наук Центральный сибирский ботанический сад СО РАН ЦСБС СО РАН.",
        link: "https://ru.wikipedia.org/wiki/%D0%9A%D1%80%D0%B0%D1%81%D0%BD%D0%BE%D0%B1%D0%BE%D1%80%D0%BE%D0%B2,_%D0%98%D0%B2%D0%B0%D0%BD_%D0%9C%D0%BE%D0%B8%D1%81%D0%B5%D0%B5%D0%B2%D0%B8%D1%87",
        isPassedAway: true
    },
    {
        id: "shmakov",
        name: "Шмаков Александр Иванович",
        years: "",
        regalia: "– профессор кафедры ботаники, директор Южно-Сибирского ботанического сада Алтайского государственного университета, доктор биологических наук.",
        link: "https://www.asu.ru/persons/371/",
        isPassedAway: false
    },
    {
        id: "dorofeev",
        name: "Дорофеев Владимир Иванович",
        years: "",
        regalia: "– старший научный сотрудник Гербария (БИН РАН, г. Санкт-Петербург). Систематик высших растений. Доцент кафедры биогеографии факультета географии и геоэкологии СПбГУ, доктор биологических наук.",
        link: "https://www.binran.ru/sotrudniki/4982/",
        isPassedAway: false
    },
    {
        id: "shaulo",
        name: "Шауло Дмитрий Николаевич",
        years: "",
        regalia: "– в.н.с., заведующий лабораторией Гербарий (ЦСБС РАН, г. Новосибирск). Систематик высших растений. кандидат биологических наук, старший научный сотрудник.",
        link: "http://www.csbg.nsc.ru/ru/struktura/nauchnye-podrazdeleniya/laboratoriya-gerbarij/sotrudniki-5/shaulo-dmitrij-nikolaevich.html",
        isPassedAway: false
    }
];

export const colleaguesList = [
    {
        id: "smirnov",
        name: "Смирнов Сергей Владимирович",
        regalia: "– кандидат биологических наук. Доцент. Директор института биологии и биотехнологии.",
        link: "https://www.asu.ru/persons/369/"
    },
    {
        id: "german",
        name: "Герман Дмитрий Александрович",
        regalia: "– кандидат биологических наук. Ведущий научный сотрудник.",
        link: "https://ru.wikipedia.org/wiki/%D0%93%D0%B5%D1%80%D0%BC%D0%B0%D0%BD,_%D0%94%D0%BC%D0%B8%D1%82%D1%80%D0%B8%D0%B9_%D0%90%D0%BB%D0%B5%D0%BA%D1%81%D0%B0%D0%BD%D0%B4%D1%80%D0%BE%D0%B2%D0%B8%D1%87",
    },
    {
        id: "kosachev",
        name: "Косачев Петр Алексеевич",
        regalia: "– кандидат биологических наук. Ведущий научный сотрудник.",
        link: "https://www.asu.ru/persons/370/",
        note: "Отдельное спасибо Петру Алексеевичу за предоставленные фотоматериалы пейзажей Алтайской горной страны."
    },
    {
        id: "vaganov",
        name: "Ваганов Алексей Владимирович",
        regalia: "– доктор биологических наук. Ведущий научный сотрудник. Проректор по научному и инновационному развитию.",
        link: "https://www.asu.ru/persons/780/"
    }
];
