
import './MainText.css'
import MountCountryMap from "../MountCountryMap/MountCountryMap.jsx"
import AltaiGallery from "../Slider/Slider.jsx"
import { useState } from "react";
import ContactForm from "../ContactForm/ContactForm.jsx"
import Footer from "../Footer/Footer.jsx";
import ButtonUp from "../ButtonUp/ButtonUp.jsx";


const MainText = () => {
    const [isFormOpen, setIsFormOpen] = useState(false);
    return (
       <>
           <div className="container">

               <MountCountryMap />
               <ButtonUp />
               <div className="map-descr">
                   <p className="ags__regions">
                       <b>Условные обозначения</b>: А – Алтайская (районы: А1 – Северно-Алтайский, А2 –
                       Северо-Восточно-Алтайский, А3 – Центрально-Алтайский, А4 – Чулышманский, А5 – Абакано-Джебашский, А6
                       – Хемчикский); КАД – Алтае-Джунгарская (районы: КАД1 – Северо-Западно-Алтайский, КАД2 – Калбинский,
                       КАД3 – Тарбагатайский, КАД4 – Саурский, КАД5 – Зайсанский, КАД6 – Бухтарминский, КАД7 –
                       Маркаколь-Канасский, КАД8 – Черно-Иртышский, КАД9 – Алтае-Джунгарский); ЗМ, ЮМ –
                       Тувинско-Монгольская (районы: ЗМ1 – Чуе-Кобдосский, ЗМ2 – Цаган-Гольский, ЗМ3 –
                       Кобдосско-Тонхильский, ЮМ – Южно-Монгольский).
                   </p>

                   <p className="ags__text">
          <span>
            <a className="ags__link"
               href="http://altaiflora.asu.ru/ru/%d0%ba%d0%b0%d1%80%d1%82%d0%b0-%d0%b0%d0%b3%d1%81/"
               target="_blank"
               rel="noopener noreferrer"
            >
              Алтайская горная страна
            </a>
          </span>{" "}
                       &ndash; самое высокое поднятие среди горных стран Северной Азии. Высшие точки его &ndash; двуглавая
                       Белуха (4506 и 4400м) в Катунском хребте и горный узел Таван&ndash;Богдо&ndash;Ула (пять священных
                       гор с 3 крупнейшими вершинами в 4374, 4360 и 3981 м). Еще в 6 хребтах и горных массивах Алтая
                       вершины превышают 4000 м (Мунх&ndash;Хайрхан, Цаст&ndash;Ула, Северо&ndash;Чуйские Альпы, Хархира,
                       Сутай&ndash;Ула, Тургэн&ndash;Ула), а в еще 10 хребтах и горных массивах Алтая и Саура &ndash;
                       вершины выше 3700-3900 м.
                   </p>

                   <AltaiGallery />

                   <p className="ags__text">
                       Замечательными особенностями Алтайской горной страны являются ступенчатое сложение всего поднятия с
                       тремя основными уровнями выравнивания, наличие в центральном куполовидном поднятии обширного
                       высокогорного плато на высотах 2200&ndash;2400 и двухступенчатой системы плоских межгорных котловин
                       на уровнях 1400 и 1800&ndash;1900 м и, наконец, сочетание субширотного и субмеридианального (вплоть
                       до меридианального) простирания хребтов. Связано это с тем, что в разных районах Алтайской горной
                       страны хорошо сохранились на разных уровнях массивы древнего пенеплена, испытавшего неоднократное
                       блоковое поднятие, лишь в конце третичного и в четвертичном периоде омоложенное новейшими
                       тектоническими подвижками, а также древним, более мощным, чем ныне, оледенением. Именно поэтому и
                       вершинные участки многих хребтов Алтайской горной страны представляют широкие плоские водоразделы,
                       на которых вздымаются отдельные вершины или горные массивы как совершенно новейшие, так и, нередко,
                       явно останцовые. Особенно свойственно это для Русского Алтая и южной части Монгольского Алтая,
                       верхней части Тарбагатая и Адж&ndash;Богдо.
                   </p>

                   <p className="ags__text">
                       Господство в тектонике Алтая именно массивных блоковых поднятий подчеркивает и хорошо развитый по
                       северо-западной периферии Алтая, а также по краям Зайсанской котловины и отчасти котловины
                       Барун&ndash;Хурай передовой уступ на высотах прилегающих равнин &ndash; в среднем примерно в
                       300&ndash;340 м на севере и западе всей страны, и примерно 400&ndash;450 м в Зайсанской котловине и
                       Барун&ndash;Хурае. На востоке Алтайской горной страны пьедестал передовых низкогорий, а то и
                       среднегорных и даже резко выдающихся высокогорных массивов находится много выше, особенно по
                       направлению с севера на юг. Это и понятно, поскольку он образуется уровнями межгорных котловин
                       &ndash; Минусинской (нижний уровень 240 м), Тувинской (640 м), Убсунурской (743 м), Котловины
                       Больших озер (1028 м), Шаргын&ndash;Гоби (948 м), Заалтайской Гоби (выше 1000 м). Алтайская горная
                       страна&ndash; это и важнейший водораздельный узел. Здесь расположена основная часть верхнего
                       (горного) водосбора Оби и Иртыша, небольшая часть водосбора Енисея (крупные левые притоки Кемчик и
                       Абакан) и водосборные бассейны, питающие целый ряд разновеликих бессточных котловин Казахстана,
                       Джунгарии и Монголии. Это и крупные котловины Балхаша (современный сток р. Аягуз почти не доходит
                       до озера), Алаколя&ndash;Сассыколя, северной части Джунгарской Гоби (озеро Урунгу&ndash;нор, очень
                       недавно отделившееся от бассейна Иртыша), часть Котловины Больших озер (озеро
                       Хара&ndash;ус&ndash;нур), а также борта котловины Барун&ndash;Хурай, бессточные озерные котловины с
                       озерами Ачит&ndash;нур и Эрег&ndash;нур, Цаган&ndash;нур на севере и Алаг&ndash;нур на юге. Меньше
                       роль Алтайского водосбора в питании самого крупного озера этого региона &ndash; Увс&ndash;нура
                       (Убсу&ndash;нур).
                   </p>
               </div>
               <ButtonUp />
           </div>
           <div>
               {/* Компонент формы (передаем состояние и функцию закрытия) */}
               <ContactForm isOpen={isFormOpen} onClose={() => setIsFormOpen(false)} />

               {/* Компонент футера (передаем функцию открытия) */}
               <Footer onOpenForm={() => setIsFormOpen(true)} />
           </div>
       </>
    );
};

export default MainText;