

const morphology = [
    {
        id: 'morphology-1',
        type: 'morphology',
        number: '',
        title: 'Введение',
        description: "Морфологические признаки представителей рода Остролодочник (Oxytropis DC., семейство Fabaceae) обладают выраженной диагностической ценностью и служат надежными филогенетическими маркерами (Красная книга РФ, 2008; Minnesota Wildflowers, 2026; PictureThis, 2026; iNaturalist, 2026). На территории Алтая, являющегося одним из крупнейших центров видообразования и эндемизма данного таксона в Азиатской России, эти признаки приобретают ключевое адаптивное значение (Золотов, Черных и др., 2019). Горный Altay характеризуется резкой климатической контрастностью, градиентами высотной поясности и наличием экстремальных экотопов — от полупустынных котловин Юго-Восточного Алтая до альпийских тундр (Пленник, 1999). Архитектоника цветка, глубокая редукция побеговых систем и высокая пластичность листового аппарата алтайских остролодочников напрямую отражают их сопряженную эволюцию и эколого-анатомическую адаптацию к криоаридным и петрофитным условиям (Золотов, Черных и др., 2019; Сумневич, 1937).",
        subtitle1: '',
        description1: '',
        description2: '',
    },
    {
        id: 'morphology-2',
        type: 'morphology',
        number: '1',
        title: 'Анатомо-морфологическая дифференциация элементов цветка и плодоношения',
        description: "Цветок растений рода Oxytropis DC. на Алтае сохраняет классический зигоморфный (мотыльковый) тип строения, но его элементы несут на себе глубокий отпечаток приспособления к горному климату (Megabook, 2026; Красная книга Бурятии, 2013). Важнейшим эволюционным приобретением, закрепившимся в репродуктивной сфере данного рода, является специфическое развитие элементов венчика, обеспечивающее эффективное опыление жесткокрылыми и перепончатокрылыми насекомыми в условиях высокогорий, где активность опылителей ограничена температурным фактором и сильными ветрами. Особое значение имеет жесткость фиксации лепестков, препятствующая случайному раскрытию бутона под воздействием шквалистого ветра, что защищает фертильную пыльцу от вымывания осадками.",
        subtitle1: "Остроконечие киля (Mucro) как родовой автопоморфизм.",
        description1: "Нижние лепестки венчика, срастаясь, формируют лодочку, аппекс которой симметрично вытянут в жесткий, морфологически выраженный носик или шипик длиной от 0,5 до 3 мм (Красная книга РФ, 2008; Minnesota Wildflowers, 2026; Megabook, 2026; Красная книга Бурятии, 2013). Этот признак надежно отделяет алтайские остролодочники от морфологически близких астрагалов (Astragalus L.), у которых верхушка лодочки всегда остается тупой или закругленной без малейших следов шпорца. Данное анатомическое образование (mucro) служит не только морфологическим маркером, но и выполняет важнейшую биомеханическую функцию: оно выступает в роли рычага при контакте с насекомым-опылителем, облегчая доступ к репродуктивным органам цветка.",
        description2: '',
        image: '/images/morphology/O-campestris-flower-el.webp',
        imageAlt: 'Строение генеративных органов Oxytropis и автопоморфизм киля (Mucro). (Sowerby, 1876)'
    },
    {
        id: 'morphology-3',
        type: 'morphology',
        number: '2',
        title: 'Жизненные формы и варианты редукции побеговых систем на Алтае',
        description: 'Эволюционная радиация рода Oxytropis в условиях высокогорий и семиаридных котловин Алтая шла по пути прогрессивной редукции надземных вегетативных органов, что обусловило доминирование специализированных жизненных форм (Пленник, 1999; Золотов, Черных и др., 2019):',
        subtitle1: 'Акаулесные (бесстебельные) подушковидные формы.',
        description1: 'Акаулесные (бесстебельные) подушковидные формы: относятся к большинству алтайских видов. Анатомический стебель у них укорочен до миллиметровых размеров (Megabook, 2026; eFloras, 2026; OregonFlora, 2026; Wikipedia, 2026; Flowers of India, 2026). Главный корень переходит в мощный многоглавый каудекс (корневище), формирующий плотные прижатые подушки и дерновины, сплошь покрытые остатками отмерших черешков (например, у узколокального алтае-саянского эндемика — остролодочника чуйского Oxytropis tschujae Bunge). Данная стратегия сводит к минимуму конвекционные потери тепла от сильных высокогорных ветров и аккумулирует дефицитную влагу внутри куртины. Плотное сплетение ветвей каудекса также улавливает мелкозем и отмерший опад, формируя специфический внутренний гумусовый субстрат, поддерживающий жизнеспособность почек возобновления в бесснежные зимы.',
        subtitle2: 'Каулесные (стеблевые) формы',
        description2: 'Каулесные (стеблевые) формы: Представлены на Алтае меньшим числом видов, приуроченных к более мезофитным или затененным экотопам (например, остролодочник отклонённый Oxytropis Pilosa (Lam.) DC или Oxytropis deflexa (Pall.) DC.) (Megabook, 2026; КиберЛенинка, 2026; SaskWildflower, 2026). У них развиваются ортотропные или восходящие облиственные побеги, а генеративные цветоносы закладываются метамерно в пазухах стеблевых листьев. Высота стебля у таких видов напрямую коррелирует со степенью проективного покрытия окружающей травянистой растительности, что позволяет им успешно конкурировать за световые ресурсы в луговых сообществах.',
        description3: '',
        image: '/images/morphology/acaules-plants.png',
        imageAlt: 'Биоморфологическая структура акаулесных розеточных и подушковидных жизненных форм',
        image1: '/images/morphology/Oxytropis-pilosa-caules-plants.png',
        imageAlt1: 'Стеблевые жизненные формы. (Wikipedia)'
    },
    {
        id: 'morphology-4',
        type: 'morphology',
        number: '3',
        title: 'Эколого-анатомическая пластичность листового аппарата',
        description: 'Лист алтайских остролодочников демонстрирует три основных эволюционных тренда, направленных на оптимизацию транспирации и защиту мезофилла от экстремальной инсоляции (Пленник, 1999):',
        subtitle1: 'Непарноперистые (классические):',
        description1: 'Непарноперистые (классические): Листовая пластинка разделена на рахисе на парные боковые листочки, завершаясь терминальным непарным сегментом. Количество пар сильно варьирует, уменьшаясь у видов экстремальных скальных местообитаний с целью минимизации общей площади испаряющей поверхности.',
        subtitle2: 'Мутовчатые (вертициллятные) листочки.',
        description2: 'Мутовчатые (вертициллятные) как ультраксерофитная стратегия: являются визитной карточкой аридных зон Алтая. Боковые листочки расположены на рахисе ложными мутовками по 3–8 штук (типичный представитель — остролодочник тысячелистный Oxytropis myriophylla (Pall.) DC.) (LuontoPortti, 2026; Megabook, 2026; Красная книга Бурятии, 2013; Montana Plant Life, 2026; eFloras, 2026; Википедия, 2026; Flowers of India, 2026). Такая трехмерная архитектоника эффективно экранирует устьичную зону листа от избытного испарения, формируя застойный пограничный слой воздуха внутри «пушистой» пластинки. К этой же группе относятся уникальные алтайские эндемики из секции Baicalia (например, Oxytropis politovii Sumn.), у которых мутовчатые листочки расположены черепитчато-скученно в верхней части рахиса.',
        subtitle3:'Защитный трихомный аппарат (опушение).',
        description3: 'Защитный трихомный аппарат (опушение): почти все алтайские виды покрыты плотным эпидермальным ковром из простых (одноконечных) волокон-трихом (Megabook, 2026; Красная книга Бурятии, 2013; Wikipedia, 2026; Википедия, 2026; Temperate Plants, 2026). Шелковисто-серебристый или мохнатый войлочный слой задерживает пары воды устьичных крипт и отражает жесткое ультрафиолетовое излучение, характерное для высокогорий Алтая.',
    },
]
export default morphology